articles/2020-06-11-OrgBlog.html
<!doctype html>
<html lang="en">
<head>
<title>BLOG</title>
<!-- 2020-06-12 Fri 00:40 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Enrico Benini">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
<link rel="shortcut icon" href="../../images/favicon.ico" type="image/x-icon">
<link rel="icon" href="../../images/favicon.ico" type="image/x-icon">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.13.0/css/all.min.css">
<link href="https://fonts.googleapis.com/css?family=Montserrat" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Lato" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="../css/main.css">
<link rel="stylesheet" href="../css/blog.css">
<link rel="stylesheet" href="../css/article.css">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">BLOG</h1>

<div id="outline-container-navbar" class="outline-2 text-center navbar navbar-inverse navbar-fixed-top">
<h2 id="navbar"><a id="sec-" name="sec-"></a>Blog</h2>
<div class="outline-text-2" id="text-navbar">
<button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#collapsableNavbar">
  <span class="icon-bar"Article 6</span>
  <span class="icon-bar"></span>
  <span class="icon-bar"></span>
</button>
<a title="Home" href="../blog.html"><h1 id="navbarTitle" class="navbar-text">Blog</h1></a>
<div class="collapse navbar-collapse" id="collapsableNavbar">
  <ul class="nav navbar-nav">
    <li><a title="Home" href="../index.html"><i class="fas fa-home fa-3x" aria-hidden="true"></i></a></li>
    <li><a title="Article List" href="../articleList.html" class="navbar-text h3">Article List</a></li>
  </ul>
</div>
</div>
</div>

<div id="outline-container-Article" class="outline-2">
<h2 id="Article"><a id="sec-" name="sec-"></a>Static Personal Website with Org Mode</h2>
<div class="outline-text-2" id="text-Article">
<p>
<b>Created: <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-06-11 Thu&gt;</span></span></b>
</p>
</div>
<div id="outline-container-ArticleAbstract" class="outline-3">
<h3 id="ArticleAbstract"><a id="sec-" name="sec-"></a>Abstract</h3>
<div class="outline-text-3" id="text-ArticleAbstract">
<p>
In this article I will show you how I built this site using:
</p>
<ul class="org-ul">
<li>Org-mode
</li>
<li>Bootstrap (<a href="https://github.com/marsmining/ox-twbs">ox-twbs</a>)
</li>
<li>HTML(autogenerated) + CSS(minimal) + Javascript (<a href="https://learn.jquery.com/">JQuery</a>)
</li>
</ul>

<p>
You can find the source code of this madness in <a href="https://github.com/benkio/benkio.github.io">here</a>.
</p>

<p>
As you can see it is hosted into Github pages, therefore it's a
static webpage. However, we can get some backend
features using Org and Elisp. Of course, it's anything like a
project who has a real backend available, and some times we would
need to do some proper hacks.
</p>

<p>
Keep reading to discover the pitfalls and advantages of this approach.
</p>
</div>
</div>

<div id="outline-container-ArticleContent" class="outline-3">
<h3 id="ArticleContent"><a id="sec-" name="sec-"></a>Content</h3>
<div class="outline-text-3" id="text-ArticleContent">
<p>
In this section, I will run you through the main features of the site, inserting
links to the code where necessary.
</p>
</div>

<div id="outline-container-sec-" class="outline-4">
<h4 id="sec-">Features</h4>
<div class="outline-text-4" id="text-">
</div><ul class="org-ul"><li><a id="sec-" name="sec-"></a>Autogenerated HTML and Org-mode typing comfort<br ><div class="outline-text-5" id="text-">
<p>
One of the biggest advantages of choosing org-mode as a
technology is that you will get access to the comfort of writing
a blog using a markdown language. Then, it looks clean and comes
with a lot of features (integrated into Emacs):
</p>
<ul class="org-ul">
<li>It's easy to manipulate: tables, dates, links
</li>
<li>Organize your text in sections
</li>
<li>Create lists like this one and so on
</li>
</ul>

<p>
Basically you can do what you could do in a <code>.md</code> file and
more.
</p>

<p>
That's great!!! But what do you want at the end of the day is the
well-known trinity: HTML, CSS, JS. So, we need a way to generate
at least HTML from that. Luckily, org-mode comes with a native
export system to HTML, with its own CSS too! However, the outcome
is far from being <i>modern</i>.
</p>

<p>
How to make things better? For sure I don't want to mess up with
the CSS: I'm not a frontend dev, plus I learned a long time ago the
pain of web designing. The only other option is to <b>steal it</b>!
Fortunately, I have a go-to option: <span class="underline">Bootstrap</span>.
</p>

<p>
Anyway, Bootstrap comes with its own set of rules and structure.
Aligning the native autogenerated HTML code to that is still
very hard, but apparently someone else had my same idea and he
created an org extension that generates a Bootstrap-friendly HTML
output. This extension is called <a href="https://github.com/marsmining/ox-twbs">ox-twbs</a> and it provides a
command (<code>org-twbs-export-to-html</code>) to compile the org to HTML.
</p>

<p>
In this way I'm writing Org text right now and what you see it's
the final result. I got the responsiveness and all the styling
(almost) for free, icons included (+ <a href="https://fontawesome.com/">fontawesome</a> for the homepage).
</p>
</div>
</li>

<li><a id="sec-" name="sec-"></a>Article List and Blog Dynamic Content<br ><div class="outline-text-5" id="text-">
</div>
</li>

<li><a id="sec-" name="sec-"></a>Pagination<br ><div class="outline-text-5" id="text-">
</div>
</li></ul>
</div>
<div id="outline-container-sec-" class="outline-4">
<h4 id="sec-">Pro and Cons</h4>
<div class="outline-text-4" id="text-">
</div><ul class="org-ul"><li><a id="sec-" name="sec-"></a>Code Conciseness<br ><div class="outline-text-5" id="text-">
</div>
</li>
<li><a id="sec-" name="sec-"></a>Javascript Hacks<br ></li>
<li><a id="sec-" name="sec-"></a>Inefficiencies and Possible Workarounds<br ><div class="outline-text-5" id="text-">
</div>
</li></ul>
</div>
</div>

<div id="outline-container-ArticleConclusions" class="outline-3">
<h3 id="ArticleConclusions"><a id="sec-" name="sec-"></a>Conclusions</h3>
<div class="outline-text-3" id="text-ArticleConclusions">
</div>
</div>
</div>

<div id="outline-container-ShareButtons" class="outline-2">
<h2 id="ShareButtons"><a id="sec-" name="sec-"></a>Share Buttons</h2>
<div class="outline-text-2" id="text-ShareButtons">
<!-- AddToAny BEGIN -->
<div class="a2a_kit a2a_kit_size_32 a2a_default_style">
<a class="a2a_dd" href="https://www.addtoany.com/share"></a>
<a class="a2a_button_facebook"></a>
<a class="a2a_button_twitter"></a>
<a class="a2a_button_whatsapp"></a>
<a class="a2a_button_telegram"></a>
<a class="a2a_button_linkedin"></a>
<a class="a2a_button_email"></a>
</div>
<script async src="https://static.addtoany.com/menu/page.js"></script>
<!-- AddToAny END -->

<script type="text/javascript">
$(function() {
  $('#text-table-of-contents > ul li').first().css("display", "none");
  $('#text-table-of-contents > ul li').last().css("display", "none");
});
</script>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#navbar">Blog</a></li>
<li><a href="#Article">Static Personal Website with Org Mode</a>
<ul class="nav">
<li><a href="#ArticleAbstract">Abstract</a></li>
<li><a href="#ArticleContent">Content</a>
<ul class="nav">
<li><a href="#sec-">Features</a></li>
<li><a href="#sec-">Pro and Cons</a></li>
</ul>
</li>
<li><a href="#ArticleConclusions">Conclusions</a></li>
</ul>
</li>
<li><a href="#ShareButtons">Share Buttons</a></li>
</ul>
</div>
</nav>
</div></div></div>
</body>
</html>
